# Core tools
brew "zsh"
brew "tree-sitter"
brew "node"
brew "ripgrep"
brew "yarn"
brew "awscli"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "eza"
brew "redis"
brew "sqlite"
brew "rbenv"
brew "ruby-build"
brew "tmux"
brew "openssl@3"
brew "libyaml"
brew "gmp"
brew "pgvector"
brew "nvm"
brew "neovim"
brew "git"
brew "coreutils"
brew "ruff"
brew "wget"
brew "zoxide"

# Oh-My-Posh
tap "jandedobbeleer/oh-my-posh"
brew "oh-my-posh"

# Casks
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "font-google-sans-code"
cask "claude-code"